app/Controllers/Auth.php

    public function create()
    {
        $rules = $this->validate([
            'device_id' => 'required',
            'no_hp'  => 'required',
        ]);

        if(!$rules){
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $model = new AuthModel();
        $data = [
            'device_id' => $this->request->getVar('device_id'),
            'no_hp'  => $this->request->getVar('no_hp'),
        ];
        $model->insert($data);
        $response = [
            'status'   => 200,
            'message' => 'Data produk berhasil ditambahkan.'
        ];

        $modelLog = new LogModel();
        $dataLog = [
            'device_id' => $this->request->getVar('device_id'),
            'no_hp'  => $this->request->getVar('no_hp'),
            'log_api'  => "auth",
            'method'  => "POST",
        ];
        $modelLog->insert($dataLog);
---
INSERT INTO `tb_auth` (`device_id`, `no_hp`, `created_at`, `updated_at`) VALUES ('123', '081', '2024-06-16 07:45:01', '2024-06-16 07:45:01')
INSERT INTO `tb_log` (`device_id`, `no_hp`, `log_api`, `method`) VALUES ('123', '081', 'auth', 'POST')