app/Controllers/Message.php

SELECT *
FROM `tb_message`
ORDER BY rand()
 LIMIT 1
---
    public function index()
    {
        $model = new MessageModel();
        $data['result'] = $model->orderBy('rand()')->first();

SELECT *
FROM `tb_message`
ORDER BY rand()
 LIMIT 1
SELECT `nama`
FROM `tb_user`
WHERE `id_user` = '1'
 LIMIT 1
INSERT INTO `tb_log` (`device_id`, `no_hp`, `log_api`, `nama`, `pesan`, `method`) VALUES ('123', '081', 'message', ('Fathur'), 'Selamat Pagi', 'POST')
---
    public function create()
    {
        $rules = $this->validate([
            'device_id' => 'required',
            'no_hp'  => 'required',
        ]);

        if(!$rules){
            return $this->failValidationErrors($this->validator->getErrors());
        }else{
            $model = new MessageModel();
            $data['result'] = $model->orderBy('rand()')->first();

            $modelUser = new UserModel();
            $modelLog = new LogModel();
            $dataLog = [
                'id_user'  => $data['result']['id_user'],
                'device_id' => $this->request->getVar('device_id'),
                'no_hp'  => $this->request->getVar('no_hp'),
                'log_api'  => "message",
                'nama'  => $modelUser->select('nama')->where('id_user', $data['result']['id_user'])->first(),
                'pesan'  => $data['result']['pesan'],
                'method'  => "POST",
            ];
            $modelLog->insert($dataLog);