app/Controllers/User.php

SELECT *
FROM `tb_user`
ORDER BY rand()
 LIMIT 1
---
    public function index()
    {
        $model = new UserModel();
        $data['result'] = $model->orderBy('rand()')->first();

SELECT *
FROM `tb_user`
ORDER BY rand()
 LIMIT 1
INSERT INTO `tb_log` (`device_id`, `no_hp`, `log_api`, `nama`, `method`) VALUES ('123', '081', 'user', 'Akbar', 'POST')
---
    public function create()
    {
        $rules = $this->validate([
            'device_id' => 'required',
            'no_hp'  => 'required',
        ]);

        if(!$rules){
            return $this->failValidationErrors($this->validator->getErrors());
        }else{
            $model = new UserModel();
            $data['result'] = $model->orderBy('rand()')->first();

            $modelLog = new LogModel();
            $dataLog = [
                'id_user'  => $data['result']['id_user'],
                'device_id' => $this->request->getVar('device_id'),
                'no_hp'  => $this->request->getVar('no_hp'),
                'log_api'  => "user",
                'nama'  => $data['result']['nama'],
                'method'  => "POST",
            ];
            $modelLog->insert($dataLog);